"VerifyingYourAccount" = "Verifying your account..";
"Ok" = "Ok";
"YouAreAlreadyLoggedIn" = "You are already logged in";
"YouDontHaveEnoughBalance" = "You don't have enough balance";
"PleaseWait" = "Please wait";
"YouWereLoggedOut" = "You were logged out";
"AccountLocked" = "Account Locked";
"Error" = "Error";
"WireBeneficiaryActivateAfter %@ %@" = "WireBeneficiary will be activated after %@ %@";
"SomethingWentWrong" = "Something went wrong";
"EnterAmount" = "Enter Amount";
"UserCanceledAccountSelection" = "User canceled account selection.";
"TransferSuccessfulTitle" = "Transfer Successful";
"SuccessfulTransferMessage"= "Your transfer has been successful\nreference: %@";
"Available" = "Available";
"Send" = "Send";
"MinimumAmount" = "Minimum amount";
"MaximumAmount" ="Maximum amount";
"EmiratesNBDApp" = "Open Emirates NBD app";
"SelectSmartPass" = "Select smart pass";
"SmartPassCode" = "Enter the Smart Pass code";
"Ok" = "Ok, Got it!";
"Next" = "Next";
"Please" = "⚠️ Please";
"Dont" = " do not ";
"LoginIntoYourBank" = "login into your bank, otherwise you will be logged out from here";
"Authenticate" = "Authenticate";
"Cancel" = "Cancel";
"Confirm" = "Confirm";
"Continue" = "Continue";
"TryAgain" = "Try Again";
"Close" = "Close";
"UserCanceledAuthentication" = "User canceled authentication.";
"BankConnectionsMadeSimple" = "Bank connections, made simple.";
"LoadingAccount" = "Loading account..";
"TimeLeft" = "Time Left ";
"NoAccounts" = "No accounts found in the bank,\nPlease try again or link a different bank";
"Update" = "Update";
"Add" = "Add";
"YourAccounts" = "Your Accounts";
"Verifying" = "Verifying";
"RemoveAccount" = "Remove account";
"FetchingBalance" = "Fetching balance..";
"Updated %@" = "Updated %@";
"BeneficiaryActivateAfter %@ %@" = "Beneficiary will be activated after %@ %@";
"ConnectingWithYourBank" = "\nConnecting with your bank";
"TransferLoaderMessage1" = "\nVerifying your transfer details";
"TransferLoaderMessage2" = "\nPlease wait, processing your transfer can take up to 30 seconds";
"TransferLoaderMessage3" = "\nPlease wait, processing";
"TransferLoaderMessage4" = "\nAlmost there! Processing your transfer will take a few more seconds";
"TransferLoaderMessage5" = "\nProcessing";
"TransferLoaderMessage6" = "\nProcessing your transfer is taking longer than usual, please hold on";
